[{"title": "How to buy tokens with MyEtherWallet ?", "post_link": "https://medium.com/@Decentralized_71209/how-to-buy-tokens-with-a-myetherwallet-com-182ba8570c89?source=search_post---------0", "author_name": "Archicoin", "author_link": "https://medium.com/@Decentralized_71209", "publish_date": "2018-03-28", "last_modified_date": "2018-06-12", "readtime": "1.87", "claps": 2726, "voters": 319, "content": "How to buy tokens with MyEtherWallet ?ArchicoinFollowMar 28, 2018 · 2 min readIf you have your own full-fledged wallet that can store ERC20-compatible tokens,just you simply transfer the ETH from your wallet our Ethereum received after filling out the form.Register for one. For example, here: https: www.myetherwallet.com/2.1 Think of a password.2.2 Tap on the button “Create New Wallet”2.3 Save the file. It is very important not to lose this file. Do not give it tothird parties. Keep it in multiple safe places.2.4 Copy and sav eyour secret key.It is very important not to lose this data. Do not give it to third parties. Keep it in multiple safe places.2.5 Follow the link “view my address”2.6 Select the wallet access method: Keystore / JSONFile2.7 Upload the recently generated file and enter the password.2.8 If all is correct, your wallet will open. Address format: 0x1f5437842304E77E1E06Cd49E2a104C722073Cf7Then purchase ETH at any exchange that offers ETHEREUM purchasing. Enter the address received on registering the wallet and get the ETH, then transfer the ETH from your wallet to our Ethereum address3. If none of the methods for purchasing ARCHI tokens suit you, you can directly. contact a ARCHICOIN representative and discuss the possibility of purchasing tokens through another, convenient method for you. E-mail: decentralized @archicoin.io", "responses": 4, "tags": ["Ethereum"]}, {"title": "How to create a wallet on MyEtherWallet.com and buy UBEX Tokens using it.", "post_link": "https://medium.com/ubex/how-to-create-a-wallet-on-myetherwallet-com-and-buy-ubex-tokens-using-it-1873c142c90d?source=search_post---------1", "author_name": "Ubex AI", "author_link": "https://medium.com/@ubex", "publish_date": "2018-06-10", "last_modified_date": "2018-08-02", "readtime": "3.91", "claps": 11261, "voters": 250, "content": "How to create a wallet on MyEtherWallet.com and buy UBEX Tokens using it.Ubex AIFollowJun 10, 2018 · 4 min readWarning: All purchases of UBEX Tokens from ETH-wallets must be made only from the wallet that you indicated in your personal account. Otherwise, your transaction will be lost and the UBEX Tokens will not be credited to your account.If you do not already have an ETH-wallet at https://www.myetherwallet.com/ , then go to step 2, if you already have an ETH-wallet on MyEtherWallet, go directly to step 11.2. Go to https://www.myetherwallet.com/3. Close the pop-up window as shown in the figure.4. Before performing any other operations, make sure that the SSL certificate is specified as MyEtherWallet Inc5. Think up a complicated password and write it down so you will not lose it. Attention! This password will not be restored in the future! Enter the password in the “Enter a password” field and double-check it by clicking on the eye icon. Minimum recommended password length is 8 characters, including uppercase and lowercase letters, as well as special characters, such as (! # $% ^ & * (_ =)6. After you have entered and checked the password, click on the “Create New Wallet” button.  7. Click on the “Download Keystore File (UTC / JSON)” button in the window that appears and save the file on your hard drive, or on a USB flash drive.Attention! Do not transfer this file to anyone under any pretext. Losing this file will also prevent you from entering your ETH wallet. It will not be possible to restore it in the future either.8. After you have saved the file, go to the next step by clicking on the “I Understand. Continue” button.  9. You will be shown your Private Key in a new window. Copy it in a notebook, if possible, or print it by clicking on the “Print Paper Wallet” button.10. After you have safely saved the Private Key, proceed to the next step by clicking on the “Save Your Address” button.  11. To purchase UBEX Tokens, go to https://www.myetherwallet.com/. Close the pop-up window that appears.  12. Select the Send Ether & Tokens section. Attention! Before performing any other operations, make sure that the SSL certificate is specified as MyEtherWallet Inc [US]13. Enter your ETH wallet by selecting “Keystore / JSON File”, then click “Select Wallet File …” and select your Keystore File.14. If you did everything correctly, then a field will appear for entering a password to access your ETH wallet. Enter the password that you specified in step 5 and click the “Unlock” button.15. After you have entered the password and clicked on the “Unlock” button. The “Send Ether & Tokens” window will appear for a few seconds and at the bottom of the screen with the message “Wallet successfully decrypted”.16. To purchase UBEX Tokens, specify the address — 0x2cc1060de78aa44e3e6a86102fac93f1de49adb2 (this is the address of the Ubex smart contract) in the To Address line.  Select the amount of Ether you wish to buy UBEX Tokens with (1 UBEX = 0.00001 ETH). For example: 1  Set the Gas Limit to 200,000  Click the “Generate Transaction” button.17. To confirm the transaction, click the “Send Transaction” button.18. In the pop-up window that appears, double-check that all the data is correct, and if everything is correct, click “Yes, I am sure! Make transaction.”19. A few minutes after the transaction is processed, the UBEX Tokens will be displayed in your personal account.How to create a wallet on MetaMask and buy UBEX Tokens using it.1) If you already have MetaMask installed, go directly to step 10, if you do not have it, go to step 2. \n2) Install the…medium.comHow to participate in the Ubex Token SaleThe official Ubex tokensale is already live! Please read the following information carefully in order to make sure that…medium.com", "responses": 1, "tags": ["Ethereum", "Ubex", "Mew", "Instruction", "Token Sale"]}, {"title": "MyEtherWallet: The Reincarnation", "post_link": "https://medium.com/@myetherwallet/myetherwallet-the-reincarnation-b163f650059e?source=search_post---------2", "author_name": "MyEtherWallet", "author_link": "https://medium.com/@myetherwallet", "publish_date": "2018-02-21", "last_modified_date": "2018-05-25", "readtime": "3.71", "claps": 2440, "voters": 211, "content": "MyEtherWallet: The ReincarnationMyEtherWalletFollowFeb 21, 2018 · 4 min readIndeed, unexpected events in the last week or two mark a watershed in the history of MyEtherWallet, and I am certain that for many, questions abound. Does MEW still exist? Does MEW have a new team already in place to respond to any user issues or questions? Are there new features and services forthcoming?Well, I won’t leave you in suspense any longer. Simply put, the answers to all of the above questions are a resounding, “YES!” If you would like to continue reading, you will find more detailed responses below.Does MEW still exist?Yes! MyEtherwallet remains an independent company. We have not disbanded or rebranded, and have no affiliation with MyCrypto. The truth is, more often than not, two-person business partnerships don’t last forever. This is particularly true in cases when one person starts to believe that one can succeed without the other or when sentiments of inequity begin to brood. This an is inconvenient and often painful truth, that I have been forced to come to terms with in recent weeks.In any event, I assure you that the functionality of www.myetherwallet.com has not been interrupted or compromised in any way during the ownership transition. Fundamentally, the only change to MEW of consequence is that kvhnuke (Me! Kosala Hemachandra, IRL) has once again taken sole ownership of MEW, and will be directly overseeing the day-to-day operations of the site. In a sense, this is simply a return of the company to its roots — kvhnuke creating a user-focused platform that is safe and secure for the crypto community.To show the Ethereum community that we’re serious about keeping MEW at the top its game, I will be contributing the ETH equivalent of $1 million USD from my personal funds to the MEW donation account. I hope that this donation communicates how passionately I believe in MyEtherWallet’s future, and how dedicated to its mission I remain. More importantly, these funds will guarantee our team has the resources they require to make the advances needed to serve a growing and diverse community with transparency.Does MEW have a new team already in place to respond to any user issues or questions?Definitely! Although their names and faces are different, MEW has a dedicated team of customer care specialists and experienced developers working diligently to answer the Ethereum community’s questions, and create a better experience for our users.Moreover, our new management team and I will be making changes to the company’s organizational structure. I have learned from past mistakes, and have acknowledged where inefficiencies lie. With the explosion of interest in Ethereum and blockchain commerce over the last year or so, MEW has now become a full-time enterprise that requires a full-time team. Until the recent transition, MEW’s team had been comprised almost entirely of independent contractors, most of whom only had part-time commitments. Contractors are independent businesses and as a result, MEW could not adequately oversee these workers, nor could MEW properly incentivize these workers to give their all. While hiring these types of workers was sufficient for the fledgling side project MEW was in 2016 and into the early part of 2017, it simply could not sustain for an ever-growing, ever-evolving enterprise.Post-transition, I’m happy to say that I have already recruited eight passionate, experienced, and fun full-time team members who are motivated to give MEW and its users everything they’ve got. And, we’re are not done! MEW has been actively posting on the usual job sites seeking specific positions, but if you love MEW and believe you have something more to add to the team, then email your resume to jobs@myetherwallet.com. Feel free to tell us about yourself, and how you see yourself contributing to MEW’s future.Are there new features and services forthcoming?You bet! It’s no secret that the crypto community has grown at a staggering rate. There seem to be new MEW users everyday, but early adopters like yourselves want more — something safer, more feature-rich, and able to keep up with evolutionary changes in blockchain technology.Rest-assured that I, along with the rest of the MEW team, are prepared to meet these challenges head on. With these new donation funds, we will be adding the best people to our team to develop a better version of MyEtherWallet with a host of new features.Many in the community may be aware that prior to this transition, MEW was working to launch version 4 of the website. Due to the new landscape, as well as the fresh ideas being generated in the MyEtherWallet offices, we are in the process of reassessing this direction. Despite the amount of money and time MEW expended on V4, we’ve also learned quite a bit along the way. While I believe that V4 introduces a quality product into the marketplace, we want to take time to consider new concepts as well as community feedback before moving forward with the current incarnation of V4. We will be making announcements about the next version of MEW in the coming weeks.Now naturally, you’re final questions is likely, “Kosala, what will these new features be” or “What will the next version look like?” I’m not the kind of person who likes to announce the cool thing before I do it. I’m the kind of person who does it first, and makes sure it’s ‘cool,’ then announces it. But for now, I can say that we’re working on a streamlined UX for newcomers, a diverse set of new features for the advanced user, and educational tools where new and established users can learn about MEW and the latest blockchain technologies.Also, our new ETH donation address is 0xDECAF9CD2367cdbb726E904cD6397eDFcAe6068D and Bitcoin address is 1DECAF2uSpFTP4L1fAHR8GCLrPqdwdLse9So stay tuned. We’re moving forward!-Kosala Hemachandra (aka kvhnuke)Don’t forget to follow usMyEtherWallet.com Twitter Reddit Facebook", "responses": 7, "tags": ["Blockchain", "Ethereum", "Myetherwallet", "Cryptocurrency"]}, {"title": "Let’s Make it Official! MEW V5, MyEtherWallet’s All New Interface, Is Here", "post_link": "https://medium.com/myetherwallet/lets-make-it-official-mew-v5-myetherwallet-s-all-new-interface-is-here-2063117180a4?source=search_post---------3", "author_name": "MyEtherWallet", "author_link": "https://medium.com/@myetherwallet", "publish_date": "2019-02-11", "last_modified_date": "2019-04-09", "readtime": "7.40", "claps": 2462, "voters": 204, "content": "Let’s Make it Official! MEW V5, MyEtherWallet’s All New Interface, Is HereMyEtherWalletFollowFeb 11 · 8 min readDear #MEWfam!We are excited and proud to present MEW V5, the new interface of our Ethereum blockchain portal, completely redesigned inside and out!There is a great deal of discussion in the crypto community about the necessity of providing a great user experience if we are to see widespread blockchain adoption. At MEW, we focus on getting the best ideas out of those discussions and then implementing them, as simply and intuitively as possible, for our users.Sure, there are pretty color schemes, cute buttons and friendly fonts — but at the end of the day, here’s what a great user experience means to us:No nonsense. You shouldn’t have to endure “tech speak,” but neither should you be spoken to like you are five. We believe in a simple interface, with customer support and education available on demand — welcoming to new users, and respectful to experienced ones.No intrusion. We don’t store any data about users. There is no tracking, no emails, no ads and no demographics. We will never monetize in a way that interferes with user experience.Security matters most.In the world of crypto, interface updates are more than beautification — they are a process of arriving together, as a community, at what will work best for all current and future users of blockchains. Better interfaces are about discovering the most universally intuitive way of interacting with decentralized financial and governance structures, so that their promise of zero barrier to entry can be fully realized. We contribute to that goal by always striving to make our product more secure and more accessible!A Friendly FaceFrom the start, we wanted to create a platform that is compatible across different devices — desktop, tablet and mobile. The uncluttered, inviting interface works on any screen, immediately directing you to accessing your wallet or, if this is your first time using MEW, creating a new one.We intentionally approached our design with both the experienced user and the beginner in mind. For the experts, it should be easy to find everything they need quickly and easily. For the novices, we have made every effort to make the interface feel welcoming and to address any anxieties they may have.Intuitive and ConvenientFor example, it’s easy to tell which methods of access are most secure. We recommend hardware wallets like Ledger, KeepKey, Secalot, Trezor and BitBox, or our own MEWconnect app. For your security, we do NOT recommend accessing with keystore file, private key or mnemonic phrase. MetaMask extension continues to be a good option for wallet access, and MEW works well with Web3-injected browsers like Brave.Once the wallet is accessed, you can take care of all tasks, from checking your balance to swapping coins to interacting with contracts, without ever having to re-login. Unlock once and use all features until you log out!Wallet balances are loaded automatically, without the need for third party extensions. Not only that, MEW V5 now features notifications! No need to wonder about the status of your transaction — you will find this information updated in the notifications section, found under the familiar little bell in the navigation bar.Tokens and Swaps, Just a Click AwayIntroducing our new partner — Changelly! Although, being one of the biggest token exchanges out there with hundreds of thousands of users, it hardly needs an introduction. We are very excited to bring the seamless swap functionality of this exchange to our users.Changelly will be operating alongside Bity and Kyber Network swap functions already available on MEW. We are now featuring the full range of Kyber Network’s 60+ ERC20 tokens, including the new WBTC, for a fast, simple and secure way of exchanging tokens directly on our platform.Conveniently, the new swap page is more than a tool for swapping coins — it’s also a crypto marketplace where you can shop for the best rates when purchasing cryptocurrencies. If you are entirely new to the space, Simplex offers an easy way to buy ETH with a credit card — so you can set out on your crypto journey without delay.The Ethereum ecosystem is always becoming more prolific and varied — there are so many tokens out there, so many opportunities to invest in something that is valuable to you. Managing all these tokens can be tricky, but we have implemented a long-requested feature to help you out — presenting the token search bar! Search and load 1100+ token balances in a matter of seconds, and if those are not enough, you can still add custom tokens, just as before.To take the FUD out of transactions, we have integrated SafeSend, an opt-in anti-fraud feature developed by Coral Protocol. SafeSend reroutes outgoing funds to a smart contract while Coral Protocol verifies the trustworthiness of the destination address. This awesome feature prevents users from accidentally sending money to a fraudster.Beyond Transactions: Blockchain ExplorationWith MEW, you are not limited to the Ethereum blockchain. On the wallet dashboard, you will find a way to switch to alternative nodes on ELO, CLO, Ropsten Testnet, and Görli chains among many others, with future support for other networks. Don’t forget that MEW provides custom node support as well!Blockchains are about so much more than funds storage and transactions! There has been a flurry of activity in the Ethereum ecosystem, with decentralized applications being created every day addressing a variety of interests — from collectibles to gaming and entertainment. Developing blockchain-based financial products, like CDPs and money markets, may become especially interesting to crypto investors.The new Dapps page on MEW V5 is built with the future of a decentralized ecosystem in mind. We intend to continue building partnerships and integrations that will allow our users to interact with and manage Dapps from right inside their MEW wallet.MEW ENS: Decentralization Made AccessibleOne great way that users can interact with the blockchain right now is through ENS domain ownership. Go ahead and type in your name, your brand or a fun acronym that could come in handy later! Pick a name for your wallet, so that others can transfer funds to you as easily as through personal messaging. With MEW, you can check the availability of ENS domains, start and finalize auctions, and manage domain ownership.Most excitingly, ENS (Ethereum Name Service) and IPFS (InterPlanetary File System) make decentralized hosting possible. Now, you can access MEW V5 not just on www.myetherwallet.com, but also using myetherwallet.eth (you need to have MetaMask extension installed). This means that MEW V5 is completely hosted in a decentralized cloud, supporting the following ENS networks: Ethereum, Ropsten, Goerli, RSK. We wouldn’t be MEW if we didn’t employ every technology available to make user experience more secure. ENS domains are built on smart contracts so they are not vulnerable like the DNS system. The real benefits of decentralization are becoming a reality and we are making sure that MEW users are first in line to take advantage!HD paths/Hardened PathsWe now fully support hardened HD paths. Recently, Ledger switched their default HD Paths to the hardened version, which is more secure, but a bit difficult to implement from front end. With MEW V5, you have complete support to hardened HD paths, allowing us to support latest Ledger and Keepkey default paths for HD wallets.Under the HoodWhen developing MEW V5, we did not just focus on the front end, because we would not be satisfied with a cosmetic change. We wanted to provide our users with a robust back end that can live up to the evolving future of the Ethereum ecosystem.Improved RPCWe made a complete overhaul of our API back end to enable all public RPC APIs and increased the efficiency of connections by a huge factor. Adding a new network is three clicks away and MEW V5 now supports all ETH APIs including ‘web3’, ‘eth’, ‘pubsub’, ‘net’, ‘rpc”, ‘shh’, ‘shh_pubsub’.Websockets supportAs many of you may know, RPC APIs are deprecated — meaning they will not be supported by Web3 in the future, but will be replaced by websockets. We wanted MEW V5 to be future-proof, so we enabled full websocket support for ETH, ROP and Görli as part of the backend upgrade.Service workersService workers are one of the latest trends in web technology. These scripts enable users to have the latest version of a website without worrying about caching issues. An extremely efficient built-in caching mechanism means that even if you have intermittent internet connection, or temporarily go offline while in the middle of a transaction, the flow of actions will not be interrupted.PWA supportThis is another addition to service workers. With PWA, you have the option of installing the complete MEW website as an app on your phone and use it to access your wallet. Because we built our UI with mobile users in mind, it will simply behave like a native app.Vintage MEWWhile we believe that the new interface makes the experience of storing and managing crypto funds much simpler and more enjoyable, we realize that our crypto natives may have gotten used to the original website. Good news — Vintage MEW is staying around for a while! We are quite sentimental about the interface that helped our users access the Ethereum blockchain and manage their funds for over two years. Besides, as we perfect the new MEW V5, we want to make sure we didn’t lose any of your favorite functionality from Vintage MEW.So there it is! We hope that you enjoy using MEW V5 as much as we loved creating it for you. Invite friends who are new to crypto to try it out, and let us know how it goes! As always, you can audit our open-source code on Github, reach out to us at support@myetherwallet.com, and comment on our social channels.Always here to help you on your crypto journey,#teamMEWMyEtherWallet.comTwitter InstagramRedditFacebookHackerOne", "responses": 10, "tags": ["Ethereum", "Crypto", "Blockchain", "UX", "Design"]}, {"title": "TREZOR Integration with MyEtherWallet", "post_link": "https://blog.trezor.io/trezor-integration-with-myetherwallet-3e217a652e08?source=search_post---------4", "author_name": "SatoshiLabs", "author_link": "https://blog.trezor.io/@satoshilabs", "publish_date": "2017-02-03", "last_modified_date": "2018-06-19", "readtime": "5.39", "claps": 1286, "voters": 206, "content": "TREZOR Integration with MyEtherWalletEthereum, Ethereum Classic and ERC-20 Interface for TREZORSatoshiLabsFollowFeb 3, 2017 · 6 min readIntroducing TREZOR integration with MyEtherWallet! Starting today, you can store ethers safely on your TREZORs. Control your private keys to all cryptocurrencies from the hardware wallet of your choice, and enjoy a perfect peace of mind!Ethereum is currently the cryptocurrency with the second highest market cap and second highest trade volume. We have long recognized the potential of ETH and implemented support for the coin with TREZOR firmware update 1.4.0. Facing limited resources, we are happy we can cooperate with MyEtherWallet to provide an easy and intuitive interface for you, when interacting with ethers. We believe that you, Ethereum users, will greatly benefit from this new integration!Ethereum and Ethereum Classic on TREZORYour ethers are stored and protected by the same recovery seed, which you have been using for bitcoins and other crypto. Therefore, there are no changes to how you should use your TREZOR. Your private keys to your coins remain stored in your TREZOR device even when using MEW.If you are familiar with how bitcoin works on TREZOR Wallet, the procedure is similar with Ethereum. You are just using a different wallet interface to your TREZOR.Recovering a seed on TREZOR will restore all of the cryptocurrencies, which were previously saved under the seed.TREZOR can also store ERC-20 Tokens!Just update to Firmware version 1.5.0 and above.TREZOR Firmware 1.5.0 — ERC-20, Litecoin SegWit, and RootstockTime flies by so quickly! Just look what happened to the price of bitcoin, ethers, litecoins, etc., in the meantime…blog.trezor.ioGuide: Use TREZOR with MyEtherWallet!TREZOR has officially supported Ethereum since the firmware update to version 1.4.0. If you are using FW from 1.4.0 and above, you should be all set to use MyEtherWallet with TREZOR. For your convenience, we have prepared a short guide to introduce you to the main steps.If you haven’t updated to FW 1.4.0 or higher yet and want to use these features, please follow this guide.Viewing Your Ethereum WalletThis guide assumes that your TREZOR has already been initialized and used on TREZOR Wallet, Electrum or Mycelium. If your TREZOR device is not configured yet (i.e. you haven’t used it with any application yet), please visit TREZOR Wallet to initialize it first.First, let’s open myetherwallet.com (MEW). Make sure you are using the correct currency. The selector is in the top-right part of MyEtherWallet.Since your TREZOR is already initialized, the Ethereum wallets have already been generated on the device. You are using MEW only to access them. Therefore, you can go to “View Wallet Info” or “Send Ether & Tokens” immediately.Do not generate a new wallet on MyEtherWallet. Your TREZOR is your Ethereum wallet. If you have generated a new wallet on MyEtherWallet, then those coins that you have sent there are NOT saved with your TREZOR seed.Select “TREZOR” and then click on “Connect to TREZOR”.TREZOR Connect prompt will pop up, asking you to plug in your TREZOR device. Enter your PIN and Passphrase (if you have it enabled). Then, Connect will ask you to export your public key for Ethereum account #1. This is necessary, so that MEW can load your accounts and read their balances.This window will show your TREZOR accounts/addresses and their ETH/ETC balances. Unlock for more information.In the next window, you can see your ether addresses and their balance. You should use these addresses to receive ethers into your TREZOR. Each of the addresses is a separate account; always use one for a certain action, since you cannot spend coins from Account 1 when you are using Account 2.This is it — you are viewing your Ethereum accounts which are stored on your TREZOR. If you would like to view your token balances as well, select an account and click on “Unlock”.In newer MEW versions, you will also be asked to choose a derivation path. You should always opt for the default one that MEW chooses for you. If you are transferring from a different Ethereum wallet with a different derivation path, you may use this feature to transfer your coins to your TREZOR. Please contact our Support Team for assistance.The default derivation paths used by TREZOR for ETH/ETC are as follows:ETH: m/44'/60'/0'/0/iETC: m/44'/61'/0'/0/i(We recommend using the change index, even though ETH/ETC do not have change addresses)You will be brought to a page with Account details. From here, you can also continue with with the sending process, if you would like to.Sending TransactionsIf you had chosen “Send Ether & Tokens”, you can continue from where we have left off in the previous section. If you had chosen “View Wallet Info”, please select “Send Ether & Tokens”, unlock TREZOR and select an account.At this stage, you are ready to send transactions. Enter the details, such as the amount to send and the gas limit (transaction fee) and click on “Generate Transaction”.Another TREZOR Connect prompt will show up and ask you to confirm the transaction on your TREZOR. (Your TREZOR has been unlocked in the previous stage.) Verify the transaction details before confirming.After confirming on the device, the transaction won’t be sent yet. The signed transaction data from TREZOR will be transmitted back to MEW, for one more confirmation. Only after clicking on “Send Transaction” in MEW will your ethers leave your account.Too Long; Did Not ReadSending ethers to TREZORGo to myetherwallet.comIn the upper right corner, make sure you are using ETH or ETCSelect “Send Ether & Tokens” or “View Wallet Info”Select “TREZOR”Select “Connect TREZOR”Unlock your TREZOR with PIN (and passphrase if you have it)A list of addresses will show up. Those are your ETH addresses that TREZOR manages. Use these as the destination address when you send your ethers from other wallets / exchanges.Sending ethers from TREZORGo to myetherwallet.comIn the upper right corner, make sure you are using ETH or ETCSelect “Send Ether & Tokens”Select “TREZOR”Select “Connect TREZOR”Unlock your TREZOR with PIN (and passphrase if you have it)Select the account/wallet/address you want to send ethers from (balance will show on the right)Enter value, address, and select Generate TransactionConfirm on TREZORConfirm again on MEW (select “Send Transaction”)About UsTREZOR is the most trusted and ubiquitous hardware wallet in the world. It offers an unmatched security for cryptocurrencies, password management, Second Factor, while maintaining an absolute ease-of-use, whether you are a security expert or a brand new user.SatoshiLabs is the innovator behind some of the most pivotal and influential projects in Bitcoin worldwide, from TREZOR, or CoinMap.org to Slush Pool, the world’s first bitcoin mining pool.LinksTREZOR: trezor.ioTREZOR Shop: shop.trezor.ioTREZOR Wallet: wallet.trezor.ioMyEtherWallet: myetherwallet.com", "responses": 39, "tags": ["Bitcoin", "Trezor", "Ethereum", "Development", "Updates"]}, {"title": "How to Join AI Crypto Pre-Sales and ICO using MyEtherWallet", "post_link": "https://medium.com/aicrypto/how-to-join-ai-crypto-pre-sales-and-ico-using-myetherwallet-c88fe907d1bf?source=search_post---------5", "author_name": "AIC_Sharon", "author_link": "https://medium.com/@AIC_SharonS", "publish_date": "2018-05-07", "last_modified_date": "2018-06-21", "readtime": "2.58", "claps": 1595, "voters": 151, "content": "How to Join AI Crypto Pre-Sales and ICO using MyEtherWalletAIC_SharonFollowMay 7, 2018 · 3 min readHello! In order for you to participate in our Pre-Sales and ICO, you should submit your private Ethereum ERC20 compatible wallet address on our Dashboard. We suggest you all inserting your own MyEtherWallet or MetaMask wallet address.Please, refer to this link if you are going to use MetaMask.Here are the instructions on how to join our Pre-Sales and ICO in detail:1. Visiting the MyEtherWallet WebsiteFirst, please go and visit the MyEtherWallet website.2. Accessing My Wallet on MyEtherWalletPlease, click “Send Ether & Tokens” at the top of the page.Select how you would like to access your wallet.3. Entering Information for All the TransactionsOnce you have accessed to your wallet, you can see the following page for making the transaction.The address in the first box is your MyEtherWallet address.But please, make sure it is the same address you submitted to “My AIC” page.In the 2nd box, insert the AI Crypto wallet address and send Ethereum (ETH).The address should begin with 0x and consist of 42 letters and numbers.To find the AI Crypto wallet address, please go to our official website and sign in. You will be able to see “AIC…WALLET ADDRESS,” on your Dashboard, which is shown in red border of the picture. The AI Crypto wallet address will be up at the beginning of the 1st Pre-Sale.Please, make sure you have copied the wallet address properly. AI Crypto does not take any responsibility for inserting in the wrong address for transaction on your part.In the 3rd box, enter the amount of Ethereum you want to send.Please, refer to AI Crypto official website or use the “My AIC” automatic calculator for the exchange rate of ETH to AIC, and vice versa.In the 4th box, please specify the amount of Gas you’re going to use.Gas is the transaction fee when you make an Ethereum payment. Make sure to add plenty of Gas for the transaction to be successful. The appropriate amount of gas will depend on the current Ethereum network.Click the “Generate Transaction” button after you have checked all your details of your payment.4. Make TransactionClick the “Send Transaction” button below.Then click the “Yes I am sure, Make transaction” button in the following pop-up window.You’re all set!If you have failed to make the transaction, please increase the amount of Gas and try again.Thank you!All-In Coins, AIC!Join our Telegram group chat for more information.", "responses": 6, "tags": ["Blockchain", "ICO", "Cryptocurrency", "Ethereum", "Artificial Intelligence"]}, {"title": "#MEW100K Celebration Contest", "post_link": "https://medium.com/myetherwallet/mew100k-celebration-contest-618fd92d8340?source=search_post---------6", "author_name": "MyEtherWallet", "author_link": "https://medium.com/@myetherwallet", "publish_date": "2018-04-12", "last_modified_date": "2018-11-28", "readtime": "2.04", "claps": 1179, "voters": 94, "content": "#MEW100K Celebration ContestMyEtherWalletFollowApr 12, 2018 · 3 min readThanks to your support MEW reached 100,000+ followers on Twitter, a testament to the ongoing support and involvement of our incredible community. This is a huge milestone for us, and one worth celebrating!So, we’d like to celebrate YOU, our #TeamMEW fans who have been using and spreading the word of MyEtherWallet.com. We want to thank you all for helping us become an essential part of the Ethereum ecosystem.#MEW100K :)We will be holding a contest for our followers who want to get involved. We will be giving away prizes to the top 100 contributors, and extra special prizes awarded to the top 25 and top 3 submissions. We have a whole lot of MEW swag to hand out, including t-shirts, hoodies, hats, socks, tumblers, journals, pens and stickers.Our top three winners will be receiving brand new laptops! There will be a choice of either a Macbook Pro or a MS Surface Pro. These top contributors will also be gifted with a MEW customised Ledger Wallet each and all of our MEW swag. (Prize valued at $2,600 )The following top 22 contributors will win a custom Ledger Wallet each, as well as our entire range of MEW swag.The next 25 contributors will be gifted with our complete MEW swag pack, and our remaining 50 participants will be kitted out with a great selection of swag.How To ParticipateThe cryptocurrency and blockchain space is evolving fast, and we believe education is key to secure its future.We’d like our growing community to help, support and teach each other how to use blockchain and cryptocurrencies to benefit their lives!To participate in this contest:Create an informative video with a duration of 5 minutes or less, or a visual blog post, on a certain topic around MEW and blockchain-based features.Examples of topics could include:How to use Ethereum and interact with the Ethereum blockchainWhy you need a cryptocurrency wallet and how to set one upHow to protect yourself from phishing sites or scamsThe importance of storing cryptocurrencies safely and offlineHow to purchase, send and store ETHetc.Content can be personal and humorous. As long as it is educational, you can be as creative as you’d like!Entry GuidelinesContributors must be following MEW Twitter & InstagramTweet @MyEtherWallet with the link to your video or blog post between now and 7 days after we’ve reached 100K. Keep a lookout for an announcement on our Twitter page that we’ve hit the milestone!Use hashtags #MEW100K, #MEWForce, #TeamMEWEmail contests@myetherwallet.com with your contact and post details, including name, Twitter/Instagram username/handle, email, and the link to your tweet and post. This will confirm your entry into the contestOne submission per followerPlease read official contest rules here.Also feel free to reach out to us, if you have any questionsHappy contesting! :)UPDATE (05/03/2018)We are pleased to announce that we will be extending the deadline for entries for our 100K Twitter Follower Celebration to May 31! Our community is growing by leaps and bounds, and we surpassed our goal much earlier than we expected. Get your entries in now for awesome prizes!MyEtherWallet.comTwitter Instagram RedditFacebook", "responses": 7, "tags": ["Blockchain", "Myetherwallet", "Ethereum", "Contests", "Ethereum Wallet"]}, {"title": "MyEtherWallet & MyCrypto — the litigation story between Kosala “kvhnuke” Hemachandra and Taylor “tayvano” Monahan", "post_link": "https://medium.com/@badrinat/myetherwallet-mycrypto-the-litigation-story-between-kosala-kvhnuke-hemachandra-and-taylor-36d88f4786cb?source=search_post---------7", "author_name": "Badri Natarajan", "author_link": "https://medium.com/@badrinat", "publish_date": "2018-02-09", "last_modified_date": "2018-05-24", "readtime": "4.47", "claps": 1139, "voters": 103, "content": "MyEtherWallet & MyCrypto — the litigation story between Kosala “kvhnuke” Hemachandra and Taylor “tayvano” MonahanBadri NatarajanFollowFeb 9, 2018 · 5 min readSo here I am, reading my daily news update, and I see tayvano’s post announcing she has left MEW (which apparently remains in kvhnuke’s control) and set up what appears to be a competing forked Ether wallet called MyCrypto. Kvhnuke has just responded with a statement on Reddit.Neither of them is very forthcoming about the details of the split and why it happened but it is worth noting that:Tayvano emphasizes how hard she worked on MEW in 2017, to the point of exhaustion, but pointedly says nothing about any work put in by kvhnuke. She only includes graphs of their respective code contributions over the years which appear to show that she has contributed significantly more code to MEW in the last couple of years. The implication is clear.Kvhnuke confirms that the vast majority of the MEW team has left with Tayvano, but says that he cannot go into the reasons for the split and reassures everyone that MEW is functional and he is control of the code and product and it’s business as usual.I thought I’d dig into this a little more, because every day at work I see that bad blood between co-founders often ends up in court, and lo and behold, here we have Kosala Hemachandra v Taylor Monahan & MyEtherWallet LLC, Case No. BS171730 in the Los Angeles County Superior Court (I downloaded the primary Petition in the case and put it on Dropbox for easy access here).This could be interesting.DISCLAIMER: I am qualified to practice law in England & Wales and India. I am not a California lawyer, and this is not legal advice, merely informed speculation by an experienced commercial litigator. I do not know kvhnuke or tayvano personally and have no connection with them or MEW. Also, this is being written on the day the news broke, based on the court documents I’ve seen and news from various online sources. Further developments could render this analysis invalid or out of date, as more information comes to light.The Petition tells us a lot, but raises almost as many questions as it answers.In essence, the case involves kvhnuke saying that all documents and financial records of the MyEtherWallet LLC company are in tayvano’s possession and that he is entitled to inspect them as a co-owner of the company, but she (according to him) is refusing to give him copies.There is a hearing scheduled in the case for 27 March 2018, but since they have now split and the MEW company has been dissolved (see below), the case will probably go nowhere on this issue (unless kvhnuke never got the documents and wants them badly for some reason — for example, he may need them to pursue more litigation). However, all kinds of other issues relating to the split could get added to the case.It looks like kvhnuke and tayvano haven’t been getting along for some time. The documents don’t shed light on the reasons for the breakdown in the relationship, but it isn’t hard to guess, based on tayvano’s post — she clearly feels he hasn’t been pulling his weight. We haven’t heard kvhnuke’s side of the story (except the part about her refusing to hand over documents he was entitled to see), but the fact that tayvano managed to convince most of the employees to go with her (and the evidence of the code contributions) suggests there is some weight to her story.In any event, according to the documents, they appear to have been in negotiations as of October 2017, for tayvano to sell her share in MEW to kvhnuke for $1 million, which would leave him in sole control. In the course of the negotiations, kvhnuke felt (justifiably, IMHO) that it is difficult for him to commit to a purchase price without seeing all the accounting records and documents for the company, because he can’t conduct his due diligence on the company without them. Tayvano’s refusal (or more precisely, what appears to be inadequate production of documents) resulted in this case being filed.Some more poking through company incorporation records in California shows that MyCrypto LLC was incorporated as far back as August 2017, which means tayvano has been planning this split for at least that long and probably a good deal longer.It also shows that the MyEtherWallet LLC company has been dissolved — unilaterally by tayvano alone — as of 29 Dec 2017. Which begs the question — what company is kvhnuke running now? Who actually owns and operates MEW? It could certainly have been transferred to another company — but has it been? The website security certificate still says “MyEtherWallet LLC”.We don’t know for sure of course, but I suspect that what happened is that negotiations for a buyout by kvhnuke and an amicable separation broke down. In connection with this, MyEtherWallet LLC has now been dissolved by tayvano (why?), and it looks like she has taken most of the employees and left to start a new company. Kvhnuke is left with control of the MEW software/codebase/brand and maybe a few employees (there appears to be a fight for control of the @myetherwallet Twitter account though), but since MyEtherWallet LLC has been dissolved, the legal status of all of these things is unclear.However, as far as MEW’s functionality goes, no one’s crypto holdings should be affected. MEW (and now MyCrypto) is only a front-end for accessing the Ethereum blockchain and the blockchain itself is not affected by this (it’s like using different apps to access your Gmail account — your email stays in the same place, whatever app you use to access it). Also, the MEW codebase is public and any suspicious changes to the code etc will be easily spotted, so I am not worried about that aspect — only whether such a useful tool (now two) will survive and continue to get better.I spy more litigation and stormy seas ahead (tayvano’s comment in her article that “MyEtherWallet will continue to be online until it, for whatever reason, is not online” may be a reference to current and potential litigation). I only hope the valuable service that MEW (and now MyCrypto) provides continues for the benefit of the wider crypto community.UPDATE: It’s been pointed out on Reddit that it is inaccurate for me to say that tayvano dissolved MyEtherWallet LLC “unilaterally…alone”, because when you look at the relevant documents, the company appears to have had three members/shareholders, and two of them (tayvano and the third member) dissolved the company. This is factually correct, so I am updating this post to reflect that. I could have chosen my words better — I meant to say that tayvano appears to have dissolved the company without kvhnuke’s co-operation, and as far as we know, that appears to be true. I did not mean to imply that there were only two shareholders in the company or that tayvano was the only signatory to the dissolution.", "responses": 8, "tags": ["Blockchain", "Myetherwallet", "Crypto", "Ethereum", "Ethereum Wallet"]}, {"title": "Participating in Token Sale: Creating MyEtherWallet", "post_link": "https://medium.com/consentium/participating-in-token-sale-creating-myetherwallet-8e6f6aa535fa?source=search_post---------8", "author_name": "Consentium", "author_link": "https://medium.com/@consentium", "publish_date": "2018-04-13", "last_modified_date": "2018-05-08", "readtime": "2.92", "claps": 586, "voters": 82, "content": "Participating in Token Sale: Creating MyEtherWalletConsentiumFollowApr 13, 2018 · 3 min readWith the token sale launching in 2 days, be sure that you have already prepared yourself for the token sale!To receive CSM coins, you will first need a digital wallet to store your CSM coins. This guide shows you how to create the digital wallet on MyEtherWallet (MEW), that can be used to hold Ethereum and other ERC20 tokens.STEP 1: MYETHERWALLETHead on over to https://www.myetherwallet.com and make sure the URL is HTTPS instead of HTTP. This is to ensure that the site is secure and also prevents attempts of phishing.STEP 2: CREATING PASSWORDType in a password of your choice and select “Create New Wallet”.Main pageSTEP 3: KEYSTORE FILEClick on “Download Keystore File (UTC / JSON)” to save your Keystore file. Upon clicking, it will be saved in your computer at the location of your choice. Bear in mind that this Keystore file will be needed to access your wallet. Select “I understand, Continue” to proceed.STEP 4: STORING PRIVATE KEYSave your Private Key in a safe location, digitally or physically.We highly recommend printing the paper wallet for safekeeping, as this will be your backup to access your MyEtherWallet in the event of losing the digital Keystore file.STEP 5: ACCESSING MEWTo access your wallet, first, click on “Send Ether & Tokens”.Next, select “Keystore File (UTC / JSON)”.Click “SELECT WALLET FILE…” and browse to select the previously saved Keystore file.Enter your password and hit “Unlock”.STEP 6: WALLET ADDRESSYour wallet address is displayed on the right. This will be the address you can use to receive Ethereum, CSM coins or any other ERC20 tokens.You may send ETH to our wallet to purchase CSM coins by keying in our address in the “To Address” field. To get our wallet address, please stay tuned to the token sale launch on 15th April at 6pm GMT+8 and participate in the KYC process!STEP 7: CHECKING TOKEN BALANCETo check your token balance, click on “Load Token Balances” and a whole list of ERC20 Tokens will be displayed. Look out for Consentium’s ticker CSM.If you are contributing with fiat currency (USD/SGD), please wait up till 48 hours after submitting your information for verification for the tokens to show up in your wallet as we will be issuing the tokens manually.For contributions using Ethereum, it will be based on a smart contract. Hence, tokens will be issued after submission and verification of your personal information during KYC.Don’t miss out! Keep yourself updated with Consentium news by joining our Telegram channel, and tweet your questions to us at @ConsentiumCoin!", "responses": 2, "tags": ["Ethereum", "Digital Wallet", "Cryptocurrency Investment", "Token Sale", "ICO"]}, {"title": "A NEW MEW — Kyber Network Integrates with MyEtherWallet", "post_link": "https://blog.kyber.network/a-new-mew-kyber-network-integrates-with-myetherwallet-7feaffbea377?source=search_post---------9", "author_name": "TN Lee", "author_link": "https://blog.kyber.network/@tnlee", "publish_date": "2018-04-24", "last_modified_date": "2018-10-06", "readtime": "2.16", "claps": 1371, "voters": 94, "content": "A NEW MEW — Kyber Network Integrates with MyEtherWalletTN LeeFollowApr 24, 2018 · 3 min readWallet integrations are essential to Kyber Network’s growth and adoption, which is why we could not be more thrilled to offer our token swap services to MyEtherWallet (MEW) in one of our biggest partnerships to date.With more than 14 million web visits each month, MEW is arguably the most popular Ethereum wallet out there. Through its free and open-source interface, users can generate public keys and private keys to set up their own Ethereum paper wallets. They can store, send, and receive Ether as well as ERC-20 tokens. The website is also compatible with Geth, Mist, MetaMask, Jaxx, Ledger Nano S, and Trezor. Most importantly, MEW does not hold on to your tokens or private keys at any time.Integrating Kyber Network’s liquidity protocol with MEW’s interface will ensure greater token accessibility and portfolio management capabilities; millions of users will now be able to convert tokens instantly and with ease from within their MEW wallets. Even non-technical newcomers will find it a breeze to navigate the new interface and obtain the tokens of their choice. The high traffic from MEW will in turn increase Kyber Network’s market penetration and enhance its position as an integrated solutions provider in the blockchain ecosystem. “The integration with MEW is a major milestone for Kyber Network in our mission to bring a secure exchange platform to more mainstream users,” said Loi Luu, CEO of Kyber Network. “We are happy to realize this mission with a significant partner like MEW, a company that has always focused on making cryptocurrencies more usable and more accessible to users.”This partnership with the Ethereum wallet giant is a validation of Kyber Network’s steady growth and product development. We are pleased to report that our platform has been running smoothly on the Ethereum network since February and we are confident of its capability to handle greater volumes than ever before. With that, we are officially opening our exchange to all users on April 30, 2018. In the meantime, we will be working hard to improve the UI/UX of our platform. Expect a lineup of key upgrades and new features, including more token pairs to be unveiled in May. We might add that the month of June will be an important one for more than just this reason, and we urge everyone to remain patient, hopeful, and ever so supportive, as we roll out special updates in the coming weeks.You can now trade on MEW by going to https://www.myetherwallet.com/#swapABOUT KYBER NETWORKKyber’s on-chain liquidity protocol allows decentralized token swaps to be integrated into any application, enabling value exchange to be performed seamlessly between all parties in the ecosystem. Using this protocol, developers can build innovative payment flows and applications, including instant token swap services, ERC20 payments, and financial DApps — helping to build a world where any token is usable anywhere.ABOUT MEWMEW is the world’s original Ethereum wallet: free, open-source, and secure. MEW empowers its users to interact directly with the blockchain while remaining in full control of their keys & funds.", "responses": 3, "tags": ["Blockchain", "Featured", "Cryptocurrency", "Trading"]}]